[
    "Example 1: \n\n Boidata: Alice Paulson is born in 1963. Alice Paulson Graduated from college in the year 1983, and Landed a job in finance shortly after, in 1987. Most recently, Alice Paulson Passed away in 2023.\nQuestion: What has Alice Paulson done between 1980 and 2028?\nAnswer: landed a job in finance, passed away.",
    "Example 2: \n\n Boidata: Brent Willie is born in 1980. Brent Willie Started coding in the year 1990, and Started a tech company shortly after, in 2001. Most recently, Brent Willie Got married in 2008.\nQuestion: What has Brent Willie done between 1991 and 2003?\nAnswer: started a tech company.",
    "Boidata: Claire Johnson is born in 1975. Claire Johnson Studied abroad in the year 1995, and Published a novel shortly after, in 2000. Most recently, Claire Johnson Retired early in 2020.\nQuestion: What has Claire Johnson done between 2001 and 2026?",
    "Boidata: Daniel Smith is born in 1988. Daniel Smith Joined the army in the year 2006, and Promoted to captain shortly after, in 2011. Most recently, Daniel Smith Started a family in 2022.\nQuestion: What has Daniel Smith done between 1997 and 2031?",
    "Boidata: Emily Davis is born in 1992. Emily Davis Enrolled in university in the year 2010, and Opened a bakery shortly after, in 2015. Most recently, Emily Davis Became a mother in 2023.\nQuestion: What has Emily Davis done between 2004 and 2027?",
    "Boidata: Frank Miller is born in 1970. Frank Miller Completed PhD in the year 1989, and Worked as a professor shortly after, in 1995. Most recently, Frank Miller Wrote a textbook in 2018.\nQuestion: What has Frank Miller done between 1986 and 2019?",
    "Boidata: Grace Lee is born in 1985. Grace Lee Traveled the world in the year 2004, and Became a chef shortly after, in 2010. Most recently, Grace Lee Opened a restaurant in 2021.\nQuestion: What has Grace Lee done between 2011 and 2021?",
    "Boidata: Henry Clark is born in 1990. Henry Clark Learned to play guitar in the year 2008, and Joined a band shortly after, in 2012. Most recently, Henry Clark Released an album in 2019.\nQuestion: What has Henry Clark done between 2005 and 2025?",
    "Boidata: Irene Nelson is born in 1978. Irene Nelson Started a blog in the year 1996, and Went viral online shortly after, in 2005. Most recently, Irene Nelson Bought a house in 2022.\nQuestion: What has Irene Nelson done between 1987 and 2015?",
    "Boidata: Jack Wilson is born in 1965. Jack Wilson Became a pilot in the year 1985, and Started a charter service shortly after, in 1990. Most recently, Jack Wilson Retired from flying in 2015.\nQuestion: What has Jack Wilson done between 1989 and 2021?",
    "Biodata: In 1963, Alice Paulson came into the world. 1983 marks the year in which Alice Paulson Graduated from college. Most notably, in 1987, Alice Paulson Landed a job in finance. Alice Paulson Passed away in 2023.\nQuestion: What did Alice Paulson do in 2022?",
    "Biodata: In 1980, Brent Willie came into the world. 1990 marks the year in which Brent Willie Started coding. Most notably, in 2001, Brent Willie Started a tech company. Brent Willie Got married in 2008.\nQuestion: What did Brent Willie do in 2007?",
    "Biodata: In 1975, Claire Johnson came into the world. 1995 marks the year in which Claire Johnson Studied abroad. Most notably, in 2000, Claire Johnson Published a novel. Claire Johnson Retired early in 2020.\nQuestion: What did Claire Johnson do in 2021?",
    "Biodata: In 1988, Daniel Smith came into the world. 2006 marks the year in which Daniel Smith Joined the army. Most notably, in 2011, Daniel Smith Promoted to captain. Daniel Smith Started a family in 2022.\nQuestion: What did Daniel Smith do in 2021?",
    "Biodata: In 1992, Emily Davis came into the world. 2010 marks the year in which Emily Davis Enrolled in university. Most notably, in 2015, Emily Davis Opened a bakery. Emily Davis Became a mother in 2023.\nQuestion: What did Emily Davis do in 2024?",
    "Biodata: In 1970, Frank Miller came into the world. 1989 marks the year in which Frank Miller Completed PhD. Most notably, in 1995, Frank Miller Worked as a professor. Frank Miller Wrote a textbook in 2018.\nQuestion: What did Frank Miller do in 2019?",
    "Biodata: In 1985, Grace Lee came into the world. 2004 marks the year in which Grace Lee Traveled the world. Most notably, in 2010, Grace Lee Became a chef. Grace Lee Opened a restaurant in 2021.\nQuestion: What did Grace Lee do in 2022?",
    "Biodata: In 1990, Henry Clark came into the world. 2008 marks the year in which Henry Clark Learned to play guitar. Most notably, in 2012, Henry Clark Joined a band. Henry Clark Released an album in 2019.\nQuestion: What did Henry Clark do in 2020?",
    "Biodata: In 1978, Irene Nelson came into the world. 1996 marks the year in which Irene Nelson Started a blog. Most notably, in 2005, Irene Nelson Went viral online. Irene Nelson Bought a house in 2022.\nQuestion: What did Irene Nelson do in 2023?",
    "Biodata: In 1965, Jack Wilson came into the world. 1985 marks the year in which Jack Wilson Became a pilot. Most notably, in 1990, Jack Wilson Started a charter service. Jack Wilson Retired from flying in 2015.\nQuestion: What did Jack Wilson do in 2015?"
]