[{"id": "0", "q_type": "age", "q": "What did Alice Paulson do at the age of 61?", "b": "Alice Paulson is born in 1963. Alice Paulson Graduated from college in the year 1983, and Landed a job in finance shortly after, in 1987. Most recently, Alice Paulson Passed away in 2023.", "a": "None"}, {"id": "1", "q_type": "age", "q": "What did Brent Willie do at the age of 27?", "b": "In 1980, Brent Willie came into the world. 1990 marks the year in which Brent Willie Started coding. Most notably, in 2001, Brent Willie Started a tech company. Brent Willie Got married in 2008.", "a": "None"}, {"id": "2", "q_type": "years", "q": "What did Claire Johnson do 3 years after Studied abroad?", "b": "Claire Johnson is born in 1975. Claire Johnson Studied abroad in the year 1995, and Published a novel shortly after, in 2000. Most recently, Claire Johnson Retired early in 2020.", "a": "None"}, {"id": "3", "q_type": "years", "q": "What did Daniel Smith do 5 years after Joined the army?", "b": "In 1988, Daniel Smith came into the world. 2006 marks the year in which Daniel Smith Joined the army. Most notably, in 2011, Daniel Smith Promoted to captain. Daniel Smith Started a family in 2022.", "a": "Promoted to captain"}, {"id": "4", "q_type": "age", "q": "What did Emily Davis do at the age of 30?", "b": "Emily Davis is born in 1992. Emily Davis Enrolled in university in the year 2010, and Opened a bakery shortly after, in 2015. Most recently, Emily Davis Became a mother in 2023.", "a": "None"}, {"id": "5", "q_type": "age", "q": "What did Frank Miller do at the age of 48?", "b": "In 1970, Frank Miller came into the world. 1989 marks the year in which Frank Miller Completed PhD. Most notably, in 1995, Frank Miller Worked as a professor. Frank Miller Wrote a textbook in 2018.", "a": "Wrote a textbook"}, {"id": "6", "q_type": "years", "q": "What did Grace Lee do 8 years after Traveled the world?", "b": "Grace Lee is born in 1985. Grace Lee Traveled the world in the year 2004, and Became a chef shortly after, in 2010. Most recently, Grace Lee Opened a restaurant in 2021.", "a": "None"}, {"id": "7", "q_type": "years", "q": "What did Henry Clark do 3 years after Learned to play guitar?", "b": "In 1990, Henry Clark came into the world. 2008 marks the year in which Henry Clark Learned to play guitar. Most notably, in 2012, Henry Clark Joined a band. Henry Clark Released an album in 2019.", "a": "None"}, {"id": "8", "q_type": "age", "q": "What did Irene Nelson do at the age of 43?", "b": "Irene Nelson is born in 1978. Irene Nelson Started a blog in the year 1996, and Went viral online shortly after, in 2005. Most recently, Irene Nelson Bought a house in 2022.", "a": "None"}, {"id": "9", "q_type": "age", "q": "What did Jack Wilson do at the age of 49?", "b": "In 1965, Jack Wilson came into the world. 1985 marks the year in which Jack Wilson Became a pilot. Most notably, in 1990, Jack Wilson Started a charter service. Jack Wilson Retired from flying in 2015.", "a": "None"}, {"id": "10", "q_type": "years", "q": "What did James Brown do 9 years after Opened a small business?", "b": "James Brown is born in 1972. James Brown Opened a small business in the year 1990, and Expanded internationally shortly after, in 2000. Most recently, James Brown Sold the company in 2022.", "a": "None"}, {"id": "11", "q_type": "years", "q": "What did Karen White do 9 years after Joined a nonprofit?", "b": "In 1985, Karen White came into the world. 2003 marks the year in which Karen White Joined a nonprofit. Most notably, in 2010, Karen White Promoted to director. Karen White Wrote a memoir in 2019.", "a": "None"}, {"id": "12", "q_type": "age", "q": "What did Liam Thompson do at the age of 33?", "b": "Liam Thompson is born in 1990. Liam Thompson Started a podcast in the year 2008, and Gained a large following shortly after, in 2014. Most recently, Liam Thompson Launched a media company in 2023.", "a": "Launched a media company"}, {"id": "13", "q_type": "age", "q": "What did Megan Taylor do at the age of 43?", "b": "In 1978, Megan Taylor came into the world. 1996 marks the year in which Megan Taylor Started teaching. Most notably, in 2003, Megan Taylor Received a teaching award. Megan Taylor Opened a tutoring center in 2021.", "a": "Opened a tutoring center"}, {"id": "14", "q_type": "years", "q": "What did Nathan Harris do 9 years after Joined a startup?", "b": "Nathan Harris is born in 1982. Nathan Harris Joined a startup in the year 2002, and Led a successful IPO shortly after, in 2011. Most recently, Nathan Harris Retired to travel in 2020.", "a": "Led a successful IPO"}, {"id": "15", "q_type": "years", "q": "What did Olivia Martinez do 5 years after Studied law?", "b": "In 1987, Olivia Martinez came into the world. 2005 marks the year in which Olivia Martinez Studied law. Most notably, in 2012, Olivia Martinez Became a judge. Olivia Martinez Authored a legal textbook in 2023.", "a": "None"}, {"id": "16", "q_type": "age", "q": "What did Paul Anderson do at the age of 30?", "b": "Paul Anderson is born in 1993. Paul Anderson Competed in athletics in the year 2011, and Won a national championship shortly after, in 2016. Most recently, Paul Anderson Became a coach in 2022.", "a": "None"}, {"id": "17", "q_type": "age", "q": "What did Quinn Roberts do at the age of 45?", "b": "In 1976, Quinn Roberts came into the world. 1994 marks the year in which Quinn Roberts Studied architecture. Most notably, in 2002, Quinn Roberts Designed a landmark building. Quinn Roberts Started a design firm in 2020.", "a": "None"}, {"id": "18", "q_type": "years", "q": "What did Rachel Lee do 9 years after Started painting?", "b": "Rachel Lee is born in 1984. Rachel Lee Started painting in the year 2002, and Held a first exhibition shortly after, in 2010. Most recently, Rachel Lee Won an art award in 2021.", "a": "None"}, {"id": "19", "q_type": "years", "q": "What did Sam Walker do 6 years after Joined a tech firm?", "b": "In 1995, Sam Walker came into the world. 2013 marks the year in which Sam Walker Joined a tech firm. Most notably, in 2017, Sam Walker Led a major project. Sam Walker Became CTO in 2023.", "a": "None"}, {"id": "20", "q_type": "age", "q": "What did Hannah Wilson do at the age of 49?", "b": "Hannah Wilson is born in 1975. Hannah Wilson Graduated in economics in the year 1997, and Started own business shortly after, in 2000. Most recently, Hannah Wilson Sold company for profit in 2022.", "a": "None"}, {"id": "21", "q_type": "age", "q": "What did Ian Roberts do at the age of 51?", "b": "In 1968, Ian Roberts came into the world. 1990 marks the year in which Ian Roberts Finished medical degree. Most notably, in 1995, Ian Roberts Became a cardiologist. Ian Roberts Retired from profession in 2018.", "a": "None"}, {"id": "22", "q_type": "years", "q": "What did Julia Bennett do 1 years after Received literature degree?", "b": "Julia Bennett is born in 1985. Julia Bennett Received literature degree in the year 2007, and Published first novel shortly after, in 2010. Most recently, Julia Bennett Won prestigious book award in 2023.", "a": "None"}, {"id": "23", "q_type": "years", "q": "What did Kevin Adams do 3 years after Graduated in computer science?", "b": "In 1992, Kevin Adams came into the world. 2014 marks the year in which Kevin Adams Graduated in computer science. Most notably, in 2018, Kevin Adams Co-founded tech company. Kevin Adams Acquired by larger firm in 2025.", "a": "None"}, {"id": "24", "q_type": "age", "q": "What did Linda Clark do at the age of 42?", "b": "Linda Clark is born in 1980. Linda Clark Began career in education in the year 2002, and Promoted to school principal shortly after, in 2007. Most recently, Linda Clark Elected to city council in 2020.", "a": "None"}, {"id": "25", "q_type": "age", "q": "What did Michael Evans do at the age of 62?", "b": "In 1960, Michael Evans came into the world. 1982 marks the year in which Michael Evans Completed law degree. Most notably, in 1985, Michael Evans Opened law firm. Michael Evans Retired from legal practice in 2020.", "a": "None"}, {"id": "26", "q_type": "years", "q": "What did Nancy Wright do 3 years after Graduated in psychology?", "b": "Nancy Wright is born in 1978. Nancy Wright Graduated in psychology in the year 2000, and Opened therapy practice shortly after, in 2005. Most recently, Nancy Wright Published self-help book in 2015.", "a": "None"}, {"id": "27", "q_type": "years", "q": "What did Oscar Young do 4 years after Completed physics degree?", "b": "In 1995, Oscar Young came into the world. 2017 marks the year in which Oscar Young Completed physics degree. Most notably, in 2020, Oscar Young Joined space research institute. Oscar Young Led major space mission in 2024.", "a": "None"}, {"id": "28", "q_type": "age", "q": "What did Patricia Taylor do at the age of 41?", "b": "Patricia Taylor is born in 1982. Patricia Taylor Graduated in fine arts in the year 2004, and Opened art gallery shortly after, in 2008. Most recently, Patricia Taylor Hosted international exhibition in 2022.", "a": "None"}, {"id": "29", "q_type": "age", "q": "What did Quincy Foster do at the age of 46?", "b": "In 1973, Quincy Foster came into the world. 1995 marks the year in which Quincy Foster Completed engineering degree. Most notably, in 1999, Quincy Foster Joined major construction company. Quincy Foster Promoted to CEO in 2019.", "a": "Promoted to CEO"}, {"id": "30", "q_type": "years", "q": "What did Bob Thompson do 3 years after Completed military service?", "b": "Bob Thompson is born in 1955. Bob Thompson Completed military service in the year 1977, and Started a family shortly after, in 1982. Most recently, Bob Thompson Retired from work in 2015.", "a": "None"}, {"id": "31", "q_type": "years", "q": "What did Catherine Lee do 4 years after Finished law degree?", "b": "In 1970, Catherine Lee came into the world. 1992 marks the year in which Catherine Lee Finished law degree. Most notably, in 1995, Catherine Lee Joined a major law firm. Catherine Lee Became a partner in 2020.", "a": "None"}, {"id": "32", "q_type": "age", "q": "What did David Johnson do at the age of 42?", "b": "David Johnson is born in 1980. David Johnson Received engineering degree in the year 2002, and Founded a tech startup shortly after, in 2006. Most recently, David Johnson Went public with IPO in 2021.", "a": "None"}, {"id": "33", "q_type": "age", "q": "What did Emma Davis do at the age of 55?", "b": "In 1965, Emma Davis came into the world. 1987 marks the year in which Emma Davis Began teaching career. Most notably, in 1992, Emma Davis Published first book. Emma Davis Received lifetime achievement award in 2019.", "a": "None"}, {"id": "34", "q_type": "years", "q": "What did Frank Harris do 9 years after Completed medical school?", "b": "Frank Harris is born in 1950. Frank Harris Completed medical school in the year 1973, and Opened private practice shortly after, in 1980. Most recently, Frank Harris Retired to countryside in 2010.", "a": "None"}, {"id": "35", "q_type": "years", "q": "What did Grace Miller do 2 years after Graduated in architecture?", "b": "In 1990, Grace Miller came into the world. 2011 marks the year in which Grace Miller Graduated in architecture. Most notably, in 2014, Grace Miller Designed first major building. Grace Miller Won international award in 2022.", "a": "None"}, {"id": "36", "q_type": "age", "q": "What did Rachel Morgan do at the age of 33?", "b": "Rachel Morgan is born in 1987. Rachel Morgan Graduated in journalism in the year 2009, and Started as news reporter shortly after, in 2012. Most recently, Rachel Morgan Became senior editor in 2021.", "a": "None"}, {"id": "37", "q_type": "age", "q": "What did Samuel Carter do at the age of 49?", "b": "In 1971, Samuel Carter came into the world. 1993 marks the year in which Samuel Carter Finished business degree. Most notably, in 1996, Samuel Carter Launched a tech startup. Samuel Carter Company went public in 2020.", "a": "Company went public"}, {"id": "38", "q_type": "years", "q": "What did Tina Mitchell do 3 years after Graduated in chemistry?", "b": "Tina Mitchell is born in 1990. Tina Mitchell Graduated in chemistry in the year 2012, and Joined pharmaceutical company shortly after, in 2016. Most recently, Tina Mitchell Led drug discovery project in 2025.", "a": "None"}, {"id": "39", "q_type": "years", "q": "What did Uriel Sanders do 7 years after Received computer engineering degree?", "b": "In 1983, Uriel Sanders came into the world. 2005 marks the year in which Uriel Sanders Received computer engineering degree. Most notably, in 2010, Uriel Sanders Founded cybersecurity firm. Uriel Sanders Acquired by multinational in 2023.", "a": "None"}, {"id": "40", "q_type": "age", "q": "What did Victoria Brooks do at the age of 43?", "b": "Victoria Brooks is born in 1976. Victoria Brooks Graduated in fashion design in the year 1998, and Opened own boutique shortly after, in 2001. Most recently, Victoria Brooks Expanded to international markets in 2020.", "a": "None"}]